package HW_4;

// Необходимо вывести числа от 0 до 15.
public class HW_4_1 {
    public static void main(String[] args) {
        for (int i = 0; i <= 15; i++) {
            System.out.println(i);
        }
    }
}
/*
Мы создаем переменную i и присваиваем ей 0. (int i = 0)
Мы задаем условие выполнения цикла, при котором цикл будет продолжаться, пока i не превысит 15. (i <= 15)
Мы увеличиваем значение i на 1 после каждой итерации цикла. (i++)
Мы выводим значение i на каждой итерации с помощью метода println().
 */